![png](Data/books.png)

In [1]:
from sqlalchemy.engine import create_engine
import pymysql
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus
username = "root"
password = quote_plus("206!!Lbs") # Using the quote function to make the password compatible
db_name = "books"
connection = f'mysql+pymysql://{username}:{password}@localhost/{db_name}'

In [2]:
import pandas as pd

In [3]:
engine = create_engine(connection)

In [4]:
engine

Engine(mysql+pymysql://root:***@localhost/books)

In [5]:
# create connection to database via the engine
conn = engine.connect()

In [6]:
# Read in the users data and preview
users = pd.read_csv('Data/users  - users (1).csv')
users.info()
users.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          3 non-null      int64
 1   first_name  3 non-null      object
 2   last_name   3 non-null      object
 3   email       3 non-null      object
dtypes: int64(1), object(3)
memory usage: 224.0+ bytes

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [7]:
q = '''DESCRIBE users;'''
describe = pd.read_sql(q, conn)
describe

        Field         Type Null  Key Default           Extra
0          id          int   NO  PRI    None  auto_increment
1  first name  varchar(45)  YES         None
2   last name  varchar(45)  YES         None
3       email  varchar(45)  YES         None

In [8]:
# Read in the authors data and preview
authors = pd.read_csv('Data/authors - authors (1).csv')
authors.info()
authors.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           5 non-null      int64
 1   author_name  5 non-null      object
dtypes: int64(1), object(1)
memory usage: 208.0+ bytes

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [9]:
q = '''DESCRIBE authors;'''
describe = pd.read_sql(q, conn)
describe

         Field         Type Null  Key Default           Extra
0           id          int   NO  PRI    None  auto_increment
1  author_name  varchar(45)  YES         None

In [10]:
# Read in the books data and preview
books = pd.read_csv('Data/books - books (1).csv')
books.info()
books.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   id         6 non-null      int64
 1   title      6 non-null      object
 2   author_id  6 non-null      int64
dtypes: int64(2), object(1)
memory usage: 272.0+ bytes

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [11]:
q = '''DESCRIBE books;'''
describe = pd.read_sql(q, conn)
describe

        Field         Type Null  Key Default           Extra
0          id          int   NO  PRI    None  auto_increment
1       Title  varchar(45)  YES         None
2  authors_id          int   NO  MUL    None

In [12]:
# Read in the favorites data and preview
favorites = pd.read_csv('Data/favorites - favorites (1).csv')
favorites.info()
favorites.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   user_id  7 non-null      int64
 1   book_id  7 non-null      int64
dtypes: int64(2)
memory usage: 240.0 bytes

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

In [13]:
q = '''DESCRIBE favorites;'''
describe = pd.read_sql(q, conn)
describe

      Field Type Null  Key Default Extra
0  books_id  int  YES  MUL    None
1  users_id  int  YES  MUL    None

In [15]:
query = """
SELECT books.Title, favorites.users_id
FROM books
JOIN favorites ON books.id = favorites.books_id
WHERE favorites.users_id = 
    (SELECT users.id FROM users WHERE (users.last_name = "Doe" AND users.first_name = "John"));"""
pd.read_sql(q, conn)

      Field Type Null  Key Default Extra
0  books_id  int  YES  MUL    None
1  users_id  int  YES  MUL    None